In [2]:
import pandas as pd
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [8]:
series=[4, 8, 15, 16, 23, 42]
df1=pd.Series(series)
print(df1,type(df1))

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64 <class 'pandas.core.series.Series'>

In [9]:
# 2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#variable print it.

In [5]:
list=["my",'name',1,2,3,4,'shtan','may',234334,76667]
df2=pd.Series(list)
print(df2,type(df2))

0        my
1      name
2         1
3         2
4         3
5         4
6     shtan
7       may
8    234334
9     76667
dtype: object <class 'pandas.core.series.Series'>

In [6]:
#Q3. Create a Pandas DataFrame that contains the following data:

In [25]:
details=[
['Alice',25,'Female'],
['Bob',30,'Male'],
['Claire',27,'Female']]

df3=pd.DataFrame(details,columns=['Name','Age','Gender'])
print(df3.to_string(index=False))

  Name  Age Gender
 Alice   25 Female
   Bob   30   Male
Claire   27 Female

In [26]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Dataframe is manily is used to struched data in format way and dataframe is
2 diemnsional which is smiliar to spreedsheet of sql  where series is 1d

In [34]:
details=[
['Alice',25,'Female'],
['Bob',30,'Male'],
['Claire',27,'Female']]

dataframe=pd.DataFrame(details,columns=['Name','Age','Gender'])
Series=dataframe['Name']
print(Series,type(Series))
print(dataframe,type(dataframe))

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object <class 'pandas.core.series.Series'>
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female <class 'pandas.core.frame.DataFrame'>

In [35]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?

In [38]:
# There are mainy function that we can use in pandas such as Head(),Tail(),info(),describe()  and many more.

details=[
['Alice',25,'Female'],
['Bob',30,'Male'],
['Claire',27,'Female']]

dataframe=pd.DataFrame(details,columns=['Name','Age','Gender'])
print(dataframe.describe())
print(dataframe.info())

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes
None

In [39]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [40]:
#Among the given options, both Series and DataFrame are mutable in nature, while Panel is deprecated and no longer recommended to use in Pandas.

In [41]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [44]:
name=pd.Series(['Abhi','love','chaubey','satyam'])
age=pd.Series([23,34,45,45])

#by using concat function we can add series int0 dataframe
df=pd.concat([name,age],axis=1)
df.columns=['name','age']

In [45]:
df

      name  age
0     Abhi   23
1     love   34
2  chaubey   45
3   satyam   45